In [3]:
import pandas as pd 
import numpy as np 

data = {
    'names' : ["shubham" , "sanket" , "shubham" , "ravi" , "sanket" , "ravi" , "shubham"], 
    'Subject' : ["Maths" , "science" , "english" , "maths" , "english" , "science" , "science"], 
    'Marks' : [85 , 90 , 78 , 88 , 76 , 82 , 91], 
    'City' : ["pune" , "delhi" , "pune" , "delhi" , "pune" , "delhi" , "pune"]
}
df = pd.DataFrame(data)
df

     names  Subject  Marks   City
0  shubham    Maths     85   pune
1   sanket  science     90  delhi
2  shubham  english     78   pune
3     ravi    maths     88  delhi
4   sanket  english     76   pune
5     ravi  science     82  delhi
6  shubham  science     91   pune

In [20]:
# names = df.groupby('names')
# data = names["Marks"].sum()
# data
print(type(data))
data.sort_values(ascending=False).head(1)

<class 'pandas.core.series.Series'>

names
shubham    254
Name: Marks, dtype: int64

In [21]:
names = df.groupby('names')
names["Subject"].count()

names
ravi       2
sanket     2
shubham    3
Name: Subject, dtype: int64

In [22]:
names = df.groupby('names')
names["Marks"].mean().sort_values(ascending=False)

names
ravi       85.000000
shubham    84.666667
sanket     83.000000
Name: Marks, dtype: float64

In [25]:
names = df.groupby(['names' , 'Subject' ])["Marks"].mean()
names

names    Subject
ravi     maths      88.0
         science    82.0
sanket   english    76.0
         science    90.0
shubham  Maths      85.0
         english    78.0
         science    91.0
Name: Marks, dtype: float64

In [27]:
names = df.groupby(['names'])["Marks"].agg(['mean' , 'sum' , 'count'])
names

              mean  sum  count
names
ravi     85.000000  170      2
sanket   83.000000  166      2
shubham  84.666667  254      3